tap "dopplerhq/cli"
tap "homebrew/services"
tap "infisical/get-cli"
tap "localstack/tap"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "openclaw/tap"
tap "steipete/tap"
tap "stripe/stripe-cli"

# CLI tools
brew "act"
brew "doctl"
brew "elixir"
brew "gh"
brew "glow"
brew "go"
brew "node"
brew "mongosh"
brew "mongodb-atlas-cli"
brew "neovim"
brew "ripgrep"
brew "rust"
brew "tmux"
brew "tree-sitter-cli"
brew "zellij"
brew "zoxide"
brew "openclaw/tap/gogcli"

# macOS apps / fonts
cask "font-jetbrains-mono-nerd-font"
cask "hammerspoon"
cask "karabiner-elements"
cask "ngrok"

# VS Code extensions. These are skipped unless the `code` CLI exists.
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "anthropic.claude-code"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "vscodevim.vim"

# Global npm packages
npm "@earendil-works/pi-coding-agent"
npm "@openai/codex"
npm "corepack"
npm "pi-mcp-adapter"
